----------------------------------------------------------------------------------------------------
SELECT * FROM MEMBER;
----------------------------------------------------------------------------------------------------
DROP TABLE MEMBER;
----------------------------------------------------------------------------------------------------
CREATE TABLE MEMBER (
        mId VARCHAR2(30) PRIMARY KEY,
        mPw VARCHAR2(30) NOT NULL,
        mName VARCHAR2(30) NOT NULL,
        mTel VARCHAR2(30) NOT NULL,
        mEmail VARCHAR2(40) NOT NULL,
        mBirth DATE NOT NULL,
        mAddr VARCHAR2(100) NOT NULL
);
-------------------------------------------------- ID로 찾기(mid confirm) --------------------------------------------------
SELECT * FROM MEMBER WHERE MID='lsj';
-------------------------------------------------- 회원가입 --------------------------------------------------
INSERT INTO MEMBER (MID, MPW, MNAME, MTEL, MEMAIL, MBIRTH, MADDR)
        VALUES ('lsj', '111', '이세정', '010-5338-5313', 'sejung1218@hanmail.net', '1992-12-18', '서울시 노원구');
-------------------------------------------------- 로그인(login) --------------------------------------------------
SELECT * FROM MEMBER WHERE MID='lsj';
-------------------------------------------------- mid로 dto 가져오기 --------------------------------------------------
SELECT * FROM MEMBER WHERE MID='lsj';
-------------------------------------------------- 정보수정 --------------------------------------------------
UPDATE MEMBER SET MPW='111',
                                     MNAME='이세정',
                                     MTEL='010-5338-5313',
                                     MEMAIL='sejung1218@hanmail.net',
                                     MBIRTH='1993-01-18',
                                     MADDR='서울시 노원구'
                        WHERE MID='lsj';
-------------------------------------------------- 회원삭제 --------------------------------------------------               
DELETE FROM MEMBER WHERE MID='lsj';
-------------------------------------------------- 가입한 회원 명수 가져오기 --------------------------------------------------
SELECT COUNT(*) FROM MEMBER;
-------------------------------------------------- startRow ~ endRow 까지 list 가져오기 --------------------------------------------------
SELECT * FROM ( SELECT ROWNUM RN, A.* FROM (SELECT * FROM MEMBER ORDER BY MID) A)
                            WHERE RN BETWEEN 1 AND 2;
-------------------------------------------------- 커밋(COMMIT) --------------------------------------------------
COMMIT;



